Revit 2027 API
ParameterTypeId.BoundaryAreaRestraintX Property
 "X Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryAreaRestraintX { get; }
Public Shared ReadOnly Property BoundaryAreaRestraintX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryAreaRestraintX {
	ForgeTypeId^ get ();
}
static member BoundaryAreaRestraintX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace